Public Member Functions | Friends | List of all members
ACAPI::MEP::v1::AccessoryDefault Class Referencefinal
MEP Element Manager
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element. More...
#include <MEPAccessoryDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::AccessoryDefault:
 Public Member Functions
Result< UniqueID >  | Place (const API_Coord3D &coordinate, const Orientation &orientation, const std::optional< API_Guid > &requiredId=std::nullopt) const
Places an Accessory element based on this Default.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementDefault
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
 void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Friends
 class  | Accessory
Result< AccessoryDefault >  | CreateAccessoryDefault (Domain)
Creates an AccessoryDefault.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementDefault
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
Detailed Description
The AccessoryDefault contains the necessary non-geometric data for creating an Accessory element.
Since
Archicad 27
Example code snippet from Test / New MEP
Placement
 {
 auto ductAccessoryDefault = CreateAccessoryDefault (Domain::Ventilation);
 if (ductAccessoryDefault.IsErr ())
 return ductAccessoryDefault.UnwrapErr ().kind;
 Orientation orientation = { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> accessoryId = ductAccessoryDefault->Place ({ 0.0, 13.0, 0.0 }, orientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (accessoryId.IsErr ())
 return accessoryId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Ventilation Accessory placed successfully", false);
 }
 {
 auto pipeAccessoryDefault = CreateAccessoryDefault (Domain::Piping);
 if (pipeAccessoryDefault.IsErr ())
 return pipeAccessoryDefault.UnwrapErr ().kind;
 Orientation orientation = { { -1.0, 0.0, 0.0 }, { 0.0, 1.0, 0.0 } };
 ACAPI::Result<UniqueID> accessoryId = pipeAccessoryDefault->Place ({ 10.0, 13.0, 0.0 }, orientation, GSGuid2APIGuid (GS::Guid::GenerateGuid));
 if (accessoryId.IsErr ())
 return accessoryId.UnwrapErr ().kind;
 ACAPI_WriteReport ("Piping Accessory placed successfully", false);
 }
Member Function Documentation
◆ Place()
 Result< UniqueID > ACAPI::MEP::v1::AccessoryDefault::Place  |  ( |  const API_Coord3D &  |  coordinate,
|  const Orientation &  |  orientation,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
) |   |  const
Places an Accessory element based on this Default.
The implementation creates an Undoable Command Scope before executing the placement. This Command Scope is automatically closed after execution. When someone would like to group the placement of several routes and/or MEP elements together, it is recommended to create a single Command Scope. Doing this prevents the opening and closing of a Command Scope for every single created route and/or MEP element, therefore the performance should be improved.
Parameters
coordinate | The coordinate where the Accessory will be placed.
orientation | The orientation of the Accessory, which is based on a direction vector and a rotation vector.
requiredId | The guid to be set for the Accessory - optional parameter
Returns
If executed with success, returns the newly placed Accessory's uniqueId, otherwise Error.
Friends And Related Symbol Documentation
◆ CreateAccessoryDefault
 Result< AccessoryDefault > CreateAccessoryDefault  |  ( |  Domain  |  domain | )
friend
Creates an AccessoryDefault.
Parameters
domain | The Domain of the requested AccessoryDefault. It can be ventilation or piping.
Returns
If able, returns a copy of Archicad's current Default of the Accessory tool for the domain defined by the parameter, otherwise Error (for ex. if domain is cable carrier).